ewpa/LibSSH-ESP32/examples/FirmwareOTAClientSCP/FirmwareOTAClientSCP.ino
// EXAMPLE main START
int ex_main(int argc, char **argv){
  printf("Your existing application would be executed here.\n");
  return 0;
}
// EXAMPLE main FINISH

#define newDevState(s) (devState = s)

void otaTask(void *pvParameter)
{
  printf("ota%% Task started\n");
  char buffer[4096];

  const esp_partition_t *bootPart = esp_ota_get_boot_partition();
  const esp_partition_t *runPart = esp_ota_get_running_partition();
  esp_ota_handle_t update_handle = 0;

  printf("ota%% Boot Partition type=%d subtype=%d addr=%d size=%d label=%s\n",
    bootPart->type, bootPart->subtype, bootPart->address, bootPart->size,
    bootPart->label);
  printf("ota%% Run Partition type=%d subtype=%d addr=%d size=%d label=%s\n",
    runPart->type, runPart->subtype, runPart->address, runPart->size,
    runPart->label);

  const esp_partition_t *newPart = esp_ota_get_next_update_partition(NULL);

  unsigned int appBytes = 0, otaBytes, otaRet;
  int scpRet;
  bool aborting;
  aborting = false;

  // Initialize the Arduino library.
  libssh_begin();
  ssh_session session = NULL;
  ssh_scp scp = NULL;
  long ssh_sess_opt_timeout = OTA_SCP_TIMEOUT_S;

  session = connect_ssh(configOTAServer, configOTAUser, verbosity);
  if (!session)
  {
    fprintf(stderr, "ota%% Unable to connect to %s\n", configOTAServer);
    aborting = true;
  }
  else ssh_options_set(session, SSH_OPTIONS_TIMEOUT, &ssh_sess_opt_timeout);

  if (!aborting)
  {
    scp = ssh_scp_new(session, SSH_SCP_READ, configOTAPath);
    if (!scp)
    {
      fprintf(stderr, "ota%% scp error: %s\n", ssh_get_error(session));
      aborting = true;
    }
  }

  if (!aborting)
  {
    if (ssh_scp_init(scp) == SSH_ERROR)
    {
      fprintf(stderr, "ota%% scp error: %s\n", ssh_get_error(session));
      aborting = true;
    }
  }

  if (!aborting)
  {
    printf("ota%% OTA Partition type=%d subtype=%d addr=%d size=%d label=%s\n",
      newPart->type, newPart->subtype, newPart->address, newPart->size,
      newPart->label);
    otaRet = esp_ota_begin(newPart, OTA_SIZE_UNKNOWN, &update_handle);
    if (otaRet != ESP_OK)
    {
      fprintf(stderr, "ota%% esp_ota_begin failed: rc=%d\n", otaRet);
      aborting = true;
    }
  }

  if (!aborting)
  {
    scpRet = ssh_scp_pull_request(scp);
    if (scpRet == SSH_SCP_REQUEST_NEWFILE)
    {
       otaBytes = ssh_scp_request_get_size(scp);
       printf("ota%% Image size = %d bytes\n", otaBytes);
       ssh_scp_accept_request(scp);
    }
    else
    {
      fprintf(stderr, "ota%% ssh_scp_pull_request failed rc=%d %s\n",
        scpRet, ssh_get_error(session));
      aborting = true;
    }
  }

  if (!aborting)
  {
    // We have found the data so attempt to write it to the flash of the
    // new partition.
    long startMillis = millis();
    short previousPercent = -1, currentPercent;
    do
    {
      scpRet = ssh_scp_read(scp, buffer, sizeof(buffer));
      if (scpRet == SSH_ERROR)
      {
        fprintf(stderr, "ota%% ssh_scp_read error: %s\n",
          ssh_get_error(session));
        aborting = true;
        break;
      }

      if (scpRet == 0) {
        printf("\nota%% Timeout after %ld seconds\r", ssh_sess_opt_timeout);
        aborting = true;
        break;
      }
      otaRet = esp_ota_write(update_handle, buffer, scpRet);
      appBytes += scpRet;
      if (otaRet != ESP_OK)
      {
        fprintf(stderr, "ota%% esp_ota_write failed: rc=%d\n", otaRet);
        aborting = true;
        break;
      }
      else
      {
        currentPercent = 100 * appBytes/otaBytes;
        if (currentPercent != previousPercent && currentPercent%1 == 0)
        {
          printf("ota%% [%d%%] Write %d bytes, so far %d (%d kBytes/s)%s\r",
            currentPercent, scpRet, appBytes,
            1000 * appBytes/(millis() - startMillis)/1024, "        ");
          fflush(NULL);
          previousPercent = currentPercent;
        }
      }
    }
    while (appBytes < otaBytes);
    printf("\n");
  }

  if (!aborting)
  {
    otaRet = esp_ota_end(update_handle);
    if (otaRet != ESP_OK)
    {
      fprintf(stderr, "ota%% esp_ota_end failed: rc=%d\n", otaRet);
      aborting = true;
    }
  }

  if (!aborting)
  {
    otaRet = esp_ota_set_boot_partition(newPart);
    if (otaRet != ESP_OK)
    {
      fprintf(stderr, "ota%% esp_ota_set_boot_partition failed: rc=%d\n",
        otaRet);
      aborting = true;
    }
  }

  if (scp) ssh_scp_free(scp);
  if (session) ssh_disconnect(session);

  if (!aborting)
  {
    printf("ota%% Flash complete, restarting in %ds\n", OTA_REBOOT_TIMEOUT_S);
    delay(OTA_REBOOT_TIMEOUT_S * 1000);
    esp_restart();
  }
  else
  {
    printf("ota%% Skipped\n");
  }

  if (session) ssh_free(session);
  ssh_finalize();

  newDevState(STATE_OTA_COMPLETE);

  printf("ota%% Task deleted\n");
  vTaskDelete(NULL);
}

esp_err_t event_cb(void *ctx, system_event_t *event)
{
  tcpip_adapter_dns_info_t dns;

  switch(event->event_id)
  {
    case SYSTEM_EVENT_STA_START:
      //#if ESP_IDF_VERSION_MAJOR < 4
      //WiFi.setHostname("libssh_esp32");
      //#endif
      Serial.print("% WiFi enabled with SSID=");
      Serial.println(configSTASSID);
      break;
    case SYSTEM_EVENT_STA_CONNECTED:
      WiFi.enableIpV6();
      wifiPhyConnected = true;
      if (devState < STATE_PHY_CONNECTED) newDevState(STATE_PHY_CONNECTED);
      break;
    case SYSTEM_EVENT_GOT_IP6:
      if (event->event_info.got_ip6.ip6_info.ip.addr[0] != htons(0xFE80)
      && !gotIp6Addr)
      {
        gotIp6Addr = true;
      }
      Serial.print("% IPv6 Address: ");
      Serial.println(IPv6Address(event->event_info.got_ip6.ip6_info.ip.addr));
      break;
    case SYSTEM_EVENT_STA_GOT_IP:
      gotIpAddr = true;
      Serial.print("% IPv4 Address: ");
      Serial.println(IPAddress(event->event_info.got_ip.ip_info.ip.addr));
      break;
    case SYSTEM_EVENT_STA_LOST_IP:
      //gotIpAddr = false;
    case SYSTEM_EVENT_STA_DISCONNECTED:
      if (devState < STATE_WAIT_IPADDR) newDevState(STATE_NEW);
      if (wifiPhyConnected)
      {
        wifiPhyConnected = false;
      }
      WiFi.begin(configSTASSID, configSTAPSK);
      break;
    default:
      break;
  }
  return ESP_OK;
}

